fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)Экспорт
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Договор КАК Договор,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПокупателя.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	ЗаказПокупателя.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВКМ_ВыполнитьАвтозаполнение()Экспорт
	
	НовыйМассив = Новый Массив;
	АбонПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	РабСпец   = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Если НЕ ЗначениеЗаполнено(АбонПлата) Или НЕ ЗначениеЗаполнено(РабСпец) Тогда
		Если Не ЗначениеЗаполнено(АбонПлата)Тогда 
			НовыйМассив.Добавить("Номенклатура абонентская плата");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(РабСпец) Тогда 
			НовыйМассив.Добавить("Номенклатура работа специалиста");
		КонецЕсли;   
		ШаблонСообщения = СтрШаблон("Не заполненно значение констант: %1", СтрСоединить(НовыйМассив," "));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ШаблонСообщения);
		Возврат;
	КонецЕсли;
	ЭтотОбъект.Товары.Очистить();
	ЭтотОбъект.Услуги.Очистить();
	Если ЭтотОбъект.Договор.ВКМ_СуммаАбонентскойПлаты <> 0 Тогда 
		Если АбонПлата.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			НоваяСтрока = ЭтотОбъект.Услуги.Добавить();
			НоваяСтрока.Номенклатура = АбонПлата;
			НоваяСтрока.Сумма = ЭтотОбъект.Договор.ВКМ_СуммаАбонентскойПлаты;
		ИначеЕсли АбонПлата.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда
			НоваяСтрока = ЭтотОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = АбонПлата;
			НоваяСтрока.Сумма = ЭтотОбъект.Договор.ВКМ_СуммаАбонентскойПлаты;
		КонецЕсли;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	СУММА(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов) КАК Количество,
				|	СУММА(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате) КАК Сумма,
				|	ВКМ_ВыполненныеКлиентуРаботы.Договор КАК Договор
				|ИЗ
				|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
				|ГДЕ
				|	ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
				|	И ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
				|
				|СГРУППИРОВАТЬ ПО
				|	ВКМ_ВыполненныеКлиентуРаботы.Договор";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Договор", ЭтотОбъект.Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если РабСпец.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			НоваяСтрока = ЭтотОбъект.Услуги.Добавить();
			НоваяСтрока.Номенклатура = РабСпец; 
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество();
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		ИначеЕсли РабСпец.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда
			НоваяСтрока = ЭтотОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = РабСпец;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество();
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		КонецЕсли;
	КонецЦикла;
	
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт 
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Договор");
	ПроверяемыеРеквизиты.Добавить("Контрагент");	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
